Enter file contents hereC2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
2960-24TT starting...
Base ethernet MAC Address: 00D0.D34C.D983
Xmodem file system is available.
Initializing Flash...
flashfs[0]: 1 files, 0 directories
flashfs[0]: 0 orphaned files, 0 orphaned directories
flashfs[0]: Total bytes: 64016384
flashfs[0]: Bytes used: 4414921
flashfs[0]: Bytes available: 59601463
flashfs[0]: flashfs fsck took 1 seconds.
...done Initializing Flash.

Boot Sector Filesystem (bs:) installed, fsid: 3
Parameter Block Filesystem (pb:) installed, fsid: 4


Loading "flash:/c2960-lanbase-mz.122-25.FX.bin"...
######################### [OK]
              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706




Cisco IOS Software, C2960 Software (C2960-LANBASE-M), Version 12.2(25)FX, RELEASE SOFTWARE (fc1)
Copyright (c) 1986-2005 by Cisco Systems, Inc.
Compiled Wed 12-Oct-05 22:05 by pt_team
Image text-base: 0x80008098, data-base: 0x814129C4



Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.


24 FastEthernet/IEEE 802.3 interface(s)
2 Gigabit Ethernet/IEEE 802.3 interface(s)

63488K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00D0.D34C.D983
Motherboard assembly number     : 73-9832-06
Power supply part number        : 341-0097-02
Motherboard serial number       : FOC103248MJ
Power supply serial number      : DCA102133JA
Model revision number           : B0
Motherboard revision number     : C0
Model number                    : WS-C2960-24TT
System serial number            : FOC1033Z1EY
Top Assembly Part Number        : 800-26671-02
Top Assembly Revision Number    : B0
Version ID                      : V02
CLEI Code Number                : COM3K00BRA
Hardware Board Revision Number  : 0x01


Switch   Ports  Model              SW Version              SW Image
------   -----  -----              ----------              ----------
*    1   26     WS-C2960-24TT      12.2                    C2960-LANBASE-M

Cisco IOS Software, C2960 Software (C2960-LANBASE-M), Version 12.2(25)FX, RELEASE SOFTWARE (fc1)
Copyright (c) 1986-2005 by Cisco Systems, Inc.
Compiled Wed 12-Oct-05 22:05 by pt_team

Press RETURN to get started!


%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up


Switch>
Switch>
Switch>en
Switch#
Switch#
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter fas
Switch(config)#inter fastEthernet 0/2
Switch(config-if)#sw
Switch(config-if)#switchport moac
Switch(config-if)#switchport moac
                               ^
% Invalid input detected at '^' marker.
	
Switch(config-if)#switchport mod
Switch(config-if)#switchport mode ac
Switch(config-if)#switchport mode access 
Switch(config-if)#sw
Switch(config-if)#switchport ac
Switch(config-if)#switchport access vl
Switch(config-if)#switchport access vlan 100
% Access VLAN does not exist. Creating vlan 100
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#switchport access vlan 100
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#
Switch#
Switch#
Switch#
Switch#
Switch#
Switch#
%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down

Switch#
Switch#
Switch#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#HOS
Switch(config)#HOStname SW_ESTRATEGIA
SW_ESTRATEGIA(config)#
SW_ESTRATEGIA(config)#
SW_ESTRATEGIA(config)#
SW_ESTRATEGIA(config)#vl
SW_ESTRATEGIA(config)#vlan 250
SW_ESTRATEGIA(config-vlan)#vlan 102
SW_ESTRATEGIA(config-vlan)#
SW_ESTRATEGIA(config-vlan)#
SW_ESTRATEGIA(config-vlan)#
SW_ESTRATEGIA(config-vlan)#exit
SW_ESTRATEGIA(config)#
SW_ESTRATEGIA(config)#
SW_ESTRATEGIA(config)#
SW_ESTRATEGIA(config)#INTRER
SW_ESTRATEGIA(config)#INTRERVLK
SW_ESTRATEGIA(config)#INT
SW_ESTRATEGIA(config)#INTerface VL
SW_ESTRATEGIA(config)#INTerface VLan 250
SW_ESTRATEGIA(config-if)#
%LINK-5-CHANGED: Interface Vlan250, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan250, changed state to up
IP AD
SW_ESTRATEGIA(config-if)#IP ADdress 192.1689.
SW_ESTRATEGIA(config-if)#IP ADdress 192.168
SW_ESTRATEGIA(config-if)#IP ADdress 192.168.250.2 255.255.255.0
SW_ESTRATEGIA(config-if)#
SW_ESTRATEGIA(config-if)#
SW_ESTRATEGIA(config-if)#EXIT
SW_ESTRATEGIA(config)#IP DE
SW_ESTRATEGIA(config)#IP DEfault-gateway 192.168.250.254
SW_ESTRATEGIA(config)#INTER
SW_ESTRATEGIA(config)#INTERface FAS
SW_ESTRATEGIA(config)#INTERface FAStEthernet 0/1
SW_ESTRATEGIA(config-if)#SW
SW_ESTRATEGIA(config-if)#SWitchport MO
SW_ESTRATEGIA(config-if)#SWitchport MOde TR
SW_ESTRATEGIA(config-if)#SWitchport MOde TRunk 



FastEthernet0/24       unassigned      YES manual down                  down
 
GigabitEthernet0/1     unassigned      YES manual down                  down
 
GigabitEthernet0/2     unassigned      YES manual down                  down
 
Vlan1                  unassigned      YES manual administratively down down
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vla
Switch(config)#vlan 250
Switch(config-vlan)#ip adr
Switch(config-vlan)#inter
Switch(config-vlan)#intervl
Switch(config-vlan)#exit
Switch(config)#inter
Switch(config)#interface vl
Switch(config)#interface vlan 250
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan250, changed state to up
ip ad
Switch(config-if)#ip address 192.168.250.1 255.255.255.0
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#ip de
Switch(config-if)#exit
Switch(config)#ip de
Switch(config)#ip default-gateway 192.168.250.254
Switch(config)#
Switch(config)#
Switch(config)#
Switch(config)#
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#
Switch#
Switch#
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#sw
Switch(config)#hos
Switch(config)#hostname 
Switch(config)#hostname SW_FINANZAS
SW_FINANZAS(config)#
SW_FINANZAS#
%SYS-5-CONFIG_I: Configured from console by console

SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
SW_FINANZAS(config)#VL
SW_FINANZAS(config)#VLan 100
SW_FINANZAS(config-vlan)#
SW_FINANZAS#
%SYS-5-CONFIG_I: Configured from console by console

SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
SW_FINANZAS(config)#INTER
SW_FINANZAS(config)#INTERface FAS
SW_FINANZAS(config)#INTERface FAStEthernet 0/1
SW_FINANZAS(config-if)#SW
SW_FINANZAS(config-if)#SWitchport MO
SW_FINANZAS(config-if)#SWitchport MOde TR
SW_FINANZAS(config-if)#SWitchport MOde TRunk 

SW_FINANZAS(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan250, changed state to up

SW_FINANZAS(config-if)#
SW_FINANZAS(config-if)#
SW_FINANZAS(config-if)#
SW_FINANZAS#
%SYS-5-CONFIG_I: Configured from console by console

SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up

SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW_FINANZAS(config)#inter
SW_FINANZAS(config)#interface fas
SW_FINANZAS(config)#interface fastEthernet 0/2
SW_FINANZAS(config-if)#sw
SW_FINANZAS(config-if)#switchport moacx
SW_FINANZAS(config-if)#switchport moa
SW_FINANZAS(config-if)#switchport mo
SW_FINANZAS(config-if)#switchport mode ac
SW_FINANZAS(config-if)#switchport mode access 
SW_FINANZAS(config-if)#sw
SW_FINANZAS(config-if)#switchport ac
SW_FINANZAS(config-if)#switchport access vl
SW_FINANZAS(config-if)#switchport access vlan 100
SW_FINANZAS(config-if)#
SW_FINANZAS(config-if)#
SW_FINANZAS(config-if)#
SW_FINANZAS(config-if)#
SW_FINANZAS#
%SYS-5-CONFIG_I: Configured from console by console

SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#
SW_FINANZAS#sh inter
SW_FINANZAS#sh interfaces vl
SW_FINANZAS#sh interfaces vlan 250
Vlan250 is up, line protocol is up
  Hardware is CPU Interface, address is 00d0.ff50.e0d3 (bia 00d0.ff50.e0d3)
  Internet address is 192.168.250.1/24
  MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 21:40:21, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1682 packets input, 530955 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicast)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     563859 packets output, 0 bytes, 0 underruns
     0 output errors, 23 interface resets
     0 output buffer failures, 0 output buffers swapped out
SW_FINANZAS#sh inter
SW_FINANZAS#sh interfaces vl
SW_FINANZAS#sh interfaces vlan 250
Vlan250 is up, line protocol is up
  Hardware is CPU Interface, address is 00d0.ff50.e0d3 (bia 00d0.ff50.e0d3)
  Internet address is 192.168.250.1/24
  MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 21:40:21, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1682 packets input, 530955 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicast)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     563859 packets output, 0 bytes, 0 underruns
     0 output errors, 23 interface resets
     0 output buffer failures, 0 output buffers swapped out
SW_FINANZAS#ping 192.168.250.254

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.250.254, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms

SW_FINANZAS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW_FINANZAS(config)#en
SW_FINANZAS(config)#ena
SW_FINANZAS(config)#enable se
SW_FINANZAS(config)#enable secret cisco
SW_FINANZAS(config)#line
SW_FINANZAS(config)#line vt
SW_FINANZAS(config)#line vty 0 14
SW_FINANZAS(config-line)#pas
SW_FINANZAS(config-line)#password cisco
SW_FINANZAS(config-line)#
SW_FINANZAS(config-line)#




ip ad
Switch(config-if)#ip address 192.168.250.254 255.255.255.0
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#interface vlan 100
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan100, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan100, changed state to up

Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#ip ad
Switch(config-if)#ip address 10.21.0.33 255.255.255.224
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface fas
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#sw
Switch(config-if)#switchport mo
Switch(config-if)#switchport mode tr
Switch(config-if)#switchport mode trunk 
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#sw
Switch(config-if)#switchport tr
Switch(config-if)#switchport trunk en
Switch(config-if)#switchport trunk encapsulation d
Switch(config-if)#switchport trunk encapsulation dot1q 
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#switchport mode trunk 

Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up

Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch(config-if)#
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#
Switch#
Switch#sh run
Switch#sh running-config 
Building configuration...

Current configuration : 1307 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
 switchport trunk encapsulation dot1q
 switchport mode trunk
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 no ip address
 shutdown
!
interface Vlan100
 ip address 10.21.0.33 255.255.255.224
!
interface Vlan250
 ip address 192.168.250.254 255.255.255.0
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!
!
!
end


Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#
Switch(config)#
Switch(config)#ip rou
Switch(config)#ip rout
Switch(config)#ip routi
Switch(config)#ip routing 
Switch(config)#
Switch(config)#
